["the", "to", "<NUM>", "in", "scipy", "a", "is", "and", "of", "for", "i", "this", "<URL>", "be", "it", "as", "with", "not", "on", "numpy", "that", "from", "python", "code", "by", "<VERSION>", "import", "if", "example", "version", "but", "error", "np", "issue", "your", "t", "information", "an", "are", "array", "function", "or", "bug", "<PATH>", "x", "when", "can", "reproducing", "file", "s", "describe", "<HASH>", "message", "final", "sys", "should", "minor", "version_info", "major", "have", "micro", "serial", "releaselevel", "which", "return", "<ISSUEREF>", "you", "at", "using", "e", "_", "print", "there", "line", "would", "problem", "method", "like", "c", "d", "true", "call", "<USER>", "please", "assigned", "so", "ticket", "trac", "stats", "_original", "unknown", "use", "output", "most", "m", "one", "shell", "has", "some", "n", "last", "my", "g", "false", "does", "all", "below", "no", "only", "traceback", "also", "value", "see", "following", "recent", "values", "found", "here", "test", "more", "same", "result", "any", "def", "system", "data", "will", "b", "user", "was", "matrix", "module", "input", "could", "time", "out", "however", "solution", "y", "self", "f", "other", "don", "request", "sparse", "we", "where", "related", "run", "do", "than", "name", "ve", "build", "used", "get", "none", "seems", "optimize", "case", "include", "work", "above", "linalg", "dtype", "shape", "add", "returns", "documentation", "lib", "py", "results", "additional", "random", "am", "lapack", "fortran", "just", "size", "between", "machine", "feature", "packages", "cython", "functions", "type", "two", "first", "gcc", "__version__", "think", "instead", "these", "blas", "context", "path", "what", "enh", "about", "note", "openblas", "then", "little", "site", "different", "bin", "valueerror", "cpu", "compiled", "python3", "because", "current", "number", "cc", "raise", "screenshots", "very", "directory", "cross", "while", "special", "linux", "dependencies", "pythran", "family", "tests", "pc", "considered", "host", "detection", "configuration", "signal", "compilers", "args", "commands", "endian", "implementation", "gfortran", "linker", "object", "arrays", "into", "up", "x86_64", "k", "since", "new", "pybind11", "fails", "alternatives", "argument", "gifs", "wrong", "parameter", "way", "r", "doesn", "expected", "report", "now", "correct", "works", "both", "set", "default", "pkgconfig", "how", "p", "may", "make", "full", "even", "nan", "range", "distribution", "order", "thank", "after", "large", "non", "possible", "currently", "apply", "given", "they", "point", "zero", "check", "me", "j", "bit", "taking", "ld", "env", "running", "sections", "behavior", "parameters", "_no", "config", "response_", "been", "fill", "axis", "class", "each", "fields", "source", "find", "such", "bfd", "matrices", "something", "fix", "view", "place", "need", "block", "else", "might", "tool", "support", "float", "points", "z", "change", "list", "max_threads", "its", "no_affinity", "dynamic_arch", "appear", "before", "incorrect", "must", "zeros", "equal", "small", "sure", "interpolate", "well", "over", "without", "pip", "too", "comment", "know", "opt", "button", "int", "clicking", "better", "preview", "simply", "max", "users", "uses", "failed", "local", "doc", "format", "many", "still", "starting", "trying", "methods", "least", "mean", "needs", "spatial", "warning", "similar", "1", "arange", "2", "bounds", "look", "v", "simple", "them", "try", "cases", "due", "algorithm", "windows", "much", "real", "sum", "gives", "returned", "working", "either", "float64", "ones", "being", "won", "inf", "len", "elements", "want", "cannot", "hi", "typeerror", "why", "usr", "already", "inside", "probably", "right", "help", "always", "available", "paste", "called", "complex", "image", "log", "show", "passed", "fail", "linear", "assertionerror", "defined", "second", "x0", "overlay", "res", "deleting", "scale", "triple", "backticks", "good", "optimization", "solve", "adding", "plt", "errors", "arguments", "info", "options", "warnings", "l", "implemented", "lambda", "though", "exception", "main", "ipython", "length", "matlab", "single", "thanks", "gh", "pass", "difference", "pr", "based", "vector", "another", "issues", "func", "option", "appears", "compute", "ndimage", "distributions", "invalid", "looks", "tmp", "maybe", "part", "actually", "failure", "got", "copy", "install", "done", "matplotlib", "minimize", "useful", "memory", "w", "failures", "inputs", "added", "problems", "fun", "missing", "seem", "integrate", "reason", "sample", "tried", "details", "h", "implement", "norm", "idea", "fixed", "io", "take", "expect", "negative", "were", "able", "normal", "original", "testing", "u", "around", "index", "encountered", "linspace", "variable", "fine", "mode", "distance", "create", "library", "rather", "whether", "dynamic_older", "no_cblas", "no_lapacke", "plot", "use_64bitint", "use_openmp", "no_lapack", "calling", "fit", "ndarray", "calls", "versions", "really", "integer", "correctly", "haswell", "needed", "allow", "read", "through", "end", "provide", "changed", "docs", "actual", "did", "few", "rendered", "solver", "less", "makes", "abs", "give", "precision", "pyplot", "those", "docstring", "pi", "reproduce", "attached", "best", "far", "noticed", "reference", "initial", "quite", "statistics", "handle", "numerical", "times", "exp", "sqrt", "believe", "cdf", "loc", "project", "rtol", "step", "dev", "multiple", "summary", "supported", "under", "within", "raises", "row", "calculate", "indices", "tolerance", "guess", "their", "cause", "filter", "standard", "warn", "according", "except", "dot", "open", "relative", "runtimewarning", "behaviour", "perhaps", "provided", "absolute", "made", "nice", "via", "atol", "kwargs", "several", "produces", "looking", "means", "takes", "clang", "constraints", "dimensions", "doing", "home", "lines", "venv", "desired", "loop", "package", "q", "types", "close", "had", "reshape", "specific", "__init__", "shows", "transform", "3", "asarray", "changes", "comments", "empty", "variables", "element", "enough", "link", "double", "numbers", "positive", "rand", "api", "causes", "process", "reports", "directly", "lower", "min", "says", "back", "conda", "darwin", "pdf", "root", "tested", "assert", "long", "scalar", "dimension", "getting", "maximum", "start", "update", "contains", "suggest", "var", "attribute", "consider", "interpolation", "happens", "short", "generate", "stdin", "hello", "performance", "having", "core", "script", "files", "libraries", "sp", "src", "maxiter", "review", "setting", "success", "tuple", "detail", "larger", "samples", "common", "general", "slow", "msg", "re", "sense", "understand", "etc", "instance", "scipy_openblas32", "sometimes", "optional", "yet", "during", "reported", "required", "requires", "examples", "faster", "installed", "string", "changing", "generated", "our", "say", "form", "status", "alternative", "csr_matrix", "failing", "avoid", "astype", "fact", "iterations", "calculation", "keyword", "kind", "seed", "arg", "gnu", "handling", "jac", "lot", "ok", "unexpected", "envs", "iteration", "runs", "alpha", "deprecated", "per", "every", "match", "down", "fault", "high", "inconsistent", "particular", "question", "remove", "cpython", "occurs", "passing", "rvs", "things", "patch", "write", "accept", "automatically", "certain", "computed", "go", "isn", "low", "computing", "content", "float32", "tol", "easy", "release", "valid", "own", "std", "convert", "exact", "left", "os", "sort", "description", "elif", "interface", "mat", "mismatch", "almost", "segmentation", "ubuntu", "0", "beta", "consistent", "specified", "against", "fft", "included", "let", "condition", "crashes", "program", "returning", "column", "load", "minimum", "three", "thread", "although", "figure", "ld64", "computation", "discussion", "label", "perform", "routine", "written", "aarch64", "clear", "csr", "gets", "guidelines", "overflow", "existing", "state", "unit", "cluster", "functionality", "itself", "checked", "ci", "exactly", "greater", "square", "bool", "built", "o", "objects", "ran", "userwarning", "cibw", "compare", "rng", "statisticsreview", "wrapper", "equivalent", "eye", "internal", "likely", "making", "outputs", "replace", "verbose", "append", "created", "definition", "great", "off", "shown", "header", "level", "pytest", "compared", "license", "ll", "nans", "never", "raised", "factor", "produce", "generic", "private", "therefore", "_internal", "addition", "assert_allclose", "checking", "kwds", "vectors", "along", "coefficients", "corresponding", "dense", "map", "seen", "__call__", "grid", "model", "someone", "statistic", "usage", "disp", "math", "mentioned", "outside", "again", "dimensional", "relevant", "temp", "documented", "easily", "attributeerror", "branch", "callback", "define", "others", "successfully", "thought", "answer", "free", "integration", "thus", "command", "ndim", "anything", "bound", "crash", "old", "removed", "resulting", "upper", "calculated", "int64", "latest", "specifically", "dist", "interval", "objective", "section", "symmetric", "across", "didn", "next", "page", "properly", "broken", "constant", "copyright", "leads", "otherwise", "sin", "exit", "fast", "int32", "linprog", "master", "vs", "allows", "follow", "intel", "longer", "often", "previous", "regression", "spline", "structure", "width", "x1", "zip", "happy", "higher", "marked", "comparison", "delete", "df", "improve", "once", "states", "uniform", "bad", "implementations", "platform", "pyx", "skipped", "smaller", "thing", "derivative", "evaluation", "reading", "shapes", "slower", "specify", "assume", "big", "creating", "efficient", "global", "limit", "present", "rank", "rotation", "rows", "cell", "depending", "described", "folders", "integers", "introduced", "mu", "provides", "suite", "th", "wl", "4", "eps", "inverse", "known", "o2", "probability", "__name__", "calculating", "environment", "explicitly", "further", "going", "locals", "necessary", "possibly", "routines", "solvers", "especially", "gamma", "keep", "mkl", "moment", "segfault", "show_config", "tell", "access", "runtest", "separate", "space", "str", "finite", "happen", "notes", "accuracy", "algorithms", "break", "convergence", "mismatched", "modified", "operations", "require", "search", "signature", "speed", "window", "arr", "count", "extra", "formula", "fpic", "identical", "items", "minimal", "pull", "solving", "total", "vectorize", "conditions", "everything", "follows", "sizes", "stack", "strong", "allowed", "approach", "contain", "custom", "diagonal", "frequency", "randn", "recently", "sequence", "stacklevel", "stored", "xp", "appdata", "constraint", "diff", "prefix", "side", "singular", "anyone", "building", "credits", "define_macros", "filters", "gradient", "ppf", "pretty", "setup", "shouldn", "appropriate", "important", "library_dirs", "propose", "proposed", "bfgs", "finding", "hidden", "implementing", "jacobian", "completely", "density", "fitting", "floating", "future", "including", "location", "macos", "steps", "suggested", "computes", "exists", "git", "writing", "intended", "language", "lapack_mkl_info", "lapack_opt_info", "occur", "operation", "suspect", "systems", "tst", "variance", "analysis", "blas_mkl_info", "blas_opt_info", "confusing", "dict", "equation", "flag", "hence", "img", "legend", "maint", "pyyaml", "slsqp", "strange", "until", "yields", "__main__", "comes", "d_fortify_source", "fstack", "haven", "march", "power", "started", "terms", "x2", "checks", "compatible", "evaluate", "fno", "hard", "later", "sigma", "callable", "csgraph", "divide", "isinstance", "observed", "terminated", "unfortunately", "ax", "extension", "myself", "runneradmin", "scikit", "seconds", "sets", "whole", "clearly", "cos", "direct", "fig", "random_state", "arpack", "builds", "causing", "course", "hand", "internally", "pandas", "prints", "wikipedia", "apparently", "assert_array_compare", "come", "conversion", "domain", "eigenvalues", "have_cblas", "kernel", "svd", "wanted", "weights", "arm64", "complete", "edit", "entries", "full_output", "pipe", "sampling", "top", "underlying", "base", "basic", "classes", "hypothesis", "loadmat", "manually", "multiply", "people", "product", "query", "save", "undefined", "updated", "accelerate", "converge", "potential", "protector", "put", "worth", "becomes", "columns", "cp310", "decomposition", "design", "development", "fs", "nit", "optimal", "paper", "pvalue", "boolean", "correlation", "depends", "discrete", "estimate", "supports", "applied", "containing", "converted", "csc", "exist", "indeed", "learn", "names", "params", "solved", "split", "together", "worked", "axes", "coo_matrix", "key", "ode", "ravel", "skip", "slightly", "whereas", "allclose", "approximation", "boundary", "discussed", "edge", "ilp64", "starts", "dataset", "evaluations", "goes", "ignore", "obvious", "solve_ivp", "apple", "col", "commit", "control", "covariance", "fvisibility", "gaussian", "generalized", "github", "helpful", "sol", "default_rng", "direction", "entry", "incorrectly", "init", "newton", "pd", "reasonable", "squares", "stackoverflow", "stop", "supposed", "taken", "xfailed", "5", "accurate", "disable", "ignored", "nd", "nfev", "nonzero", "obviously", "series", "ss", "timeit", "various", "anaconda", "breaks", "cast", "caused", "compile", "continuous", "cp311", "dumped", "explicit", "incompatible", "indexing", "metric", "requested", "runtime", "text", "throws", "cov", "debug", "dep", "differences", "extensions", "identity", "includes", "increase", "indptr", "inlines", "lead", "loops", "ms", "multivariate", "rpath", "ufunc", "converting", "evaluated", "fmessage", "giving", "half", "lists", "mask", "odd", "response", "software", "title", "valued", "zen", "diag", "difficult", "ftree", "isystem", "messages", "quick", "runtimeerror", "who", "wrap", "calculations", "compatibility", "document", "hierarchy", "indexerror", "optimized", "optimizer", "processing", "statement", "workaround", "anyway", "equations", "err_msg", "fixes", "generating", "infinite", "interp1d", "latter", "magnitude", "polynomial", "replaced", "cond", "job", "matter", "pthread", "reduce", "scaling", "sign", "trivial", "unable", "applications", "cost", "cp312", "curve_fit", "effect", "ensure", "features", "handled", "interested", "mention", "multiplication", "nearest", "potentially", "submit", "toarray", "typo", "ways", "_build_env", "_lib", "buffer", "convolve", "deprecation", "eigenvalue", "gc", "increasing", "limited", "mark", "mpmath", "operator", "regards", "slice", "xtol", "y0", "among", "casting", "compressed", "division", "independent", "loss", "mac", "median", "move", "num", "pre", "subplots", "came", "dndebug", "generator", "interest", "proper", "python2", "round", "sf", "solutions", "stable", "vectorized", "xpassed", "amount", "coefficient", "csc_matrix", "dim", "exe", "obj", "post", "randomstate", "relro", "wrote", "advance", "baseline", "bugs", "compiler", "couple", "despite", "gb", "item", "leading", "linearoperator", "locally", "near", "nothing", "obtained", "openblas_lapack_info", "origin", "proposal", "replacing", "significantly", "snippet", "thoughts", "transpose", "twice", "unless", "usually", "accepts", "alt", "derivatives", "determine", "filename", "floats", "forge", "implements", "improvement", "null", "occurred", "parts", "py3", "ub", "vals", "weird", "assignment", "average", "choice", "complex128", "continue", "deprecationwarning", "dx", "explain", "isnan", "macosx_arm64", "misc", "obtain", "passes", "reasons", "region", "respect", "session", "somewhat", "strict", "table", "target", "unnecessary", "win_amd64", "8", "basically", "concatenate", "fill_value", "include_dirs", "misleading", "performed", "pmf", "produced", "randint", "references", "todense", "trust", "10", "a1", "application", "discovered", "graph", "importerror", "nan_policy", "openblas_info", "poisson", "previously", "problematic", "rv_continuous", "array_like", "binary", "earlier", "easier", "extraframeworks", "integral", "inv", "looked", "mtune", "quad", "segfaults", "term", "ago", "construct", "coordinates", "creates", "decorator", "essentially", "extend", "extremely", "images", "lb", "lm", "lu", "modules", "opinion", "phase", "residual", "sided", "significant", "somewhere", "tree", "become", "coo", "degree", "equality", "exponential", "finally", "leak", "orders", "regular", "upon", "warren", "xi", "blis_info", "broadcasting", "ckdtree", "dependent", "dt", "explanation", "fftpack", "flags", "generates", "meaning", "meson", "pluggy", "position", "roots", "rule", "suggestion", "task", "wondering", "arbitrary", "b_ub", "box", "debugging", "degrees", "estimation", "feasible", "inner", "linkage", "mailing", "originally", "parallel", "relatively", "repo", "simd", "simplex", "us", "a_ub", "attempt", "cache", "calculates", "char", "cubic", "eig", "enhancement", "fixing", "highs", "imaginary", "kdtree", "minimization", "modify", "purpose", "rest", "seeing", "shift", "sse2", "statistical", "understanding", "weight", "adds", "amd64", "backwards", "benchmark", "cg", "copied", "eigh", "frequencies", "fully", "improved", "iterative", "least_squares", "lil_matrix", "limits", "moments", "reached", "regardless", "research", "savemat", "share", "solves", "sorted", "throw", "yield", "assert_equal", "behave", "binom", "broadcast", "center", "datasets", "enumerate", "fatal", "inaccurate", "odr", "sse", "vstack", "bytes", "cholesky", "clean", "debian", "defaults", "dictionary", "force", "gw0", "inequality", "nor", "nose", "particularly", "pointer", "robust", "sc", "silently", "associated", "complicated", "console", "definite", "deprecate", "deviation", "distances", "eigsh", "evaluating", "fp", "gdb", "ideally", "meshgrid", "normalized", "overwrite_a", "pdist", "raising", "selected", "strictly", "tries", "unique", "wheel", "wheels", "64", "alternatively", "assert_array_almost_equal", "attributes", "avx", "avx2", "comparing", "decimal", "dtypes", "enable", "entirely", "exec", "expm", "f77", "happening", "hess", "interior", "masked", "multivariate_normal", "named", "neither", "peak", "referenced", "representation", "sse3", "straightforward", "suggestions", "truncated", "txt", "utils", "address", "agree", "bessel", "bld", "cheers", "clarify", "color", "constructor", "depend", "detected", "docstrings", "generally", "height", "imag", "indicate", "installation", "instances", "matvec", "miniforge3", "nnz", "noise", "orthogonal", "qhull", "reproducible", "safe", "similarly", "specifying", "ssse3", "switch", "third", "unsupported", "win32", "6", "avx512_clx", "avx512_cnl", "avx512_skx", "avx512cd", "avx512f", "aware", "away", "dtags", "eigs", "f16c", "ffunction", "figsize", "fma3", "forward", "getattr", "hope", "hstack", "id", "inconsistency", "infinity", "labels", "lack", "linked", "namespace", "nocona", "offset", "popcnt", "possibility", "property", "qr", "removing", "sklearn", "sse41", "sse42", "st", "suggests", "super", "theta", "wrappers", "x86", "yes", "affect", "anaconda3", "appreciated", "aren", "attempting", "backend", "binomial", "coordinate", "differently", "exceptions", "feedback", "linalgerror", "miniconda3", "models", "mostly", "multi", "necessarily", "noted", "older", "past", "places", "providing", "public", "repeat", "reproduced", "respectively", "situation", "turn", "updating", "accepted", "account", "br", "deal", "eigenvectors", "eq", "extreme", "familiar", "fdebug", "field", "flatten", "handles", "importing", "join", "largest", "lfilter", "lobpcg", "mstats", "pair", "r1", "received", "ref", "scripts", "tocsr", "wrapped", "years", "7", "avx512_icl", "cdist", "check_finite", "clustering", "compiling", "constr", "demonstrates", "differential", "edges", "entire", "feel", "gw1", "immediately", "knots", "notice", "numerically", "performs", "properties", "ram", "red", "reproduces", "rootdir", "strings", "threshold", "trace", "uint8", "win", "wise", "assuming", "auto", "behaves", "computations", "computer", "decimals", "defines", "expression", "generation", "illegal", "interp", "logic", "ma", "matches", "multidimensional", "numerator", "programming", "pure", "reflect", "rhs", "scalars", "style", "supplied", "surprising", "univariatespline", "a_eq", "ask", "background", "breaking", "conj", "const", "cosine", "determined", "ends", "entropy", "epsilon", "execution", "ftol", "implicit", "individual", "lengths", "manual", "merged", "na", "nc", "overhead", "pattern", "purposes", "runner", "rv", "said", "separately", "somehow", "threads", "unstable", "welcome", "y1", "_cdf", "angle", "b_eq", "basis", "benchmarks", "choose", "closed", "cobyla", "combination", "combinations", "confirm", "csr_array", "defining", "dependency", "enabled", "extract", "f2py", "improvements", "inefficient", "leastsq", "lost", "ninja", "notebook", "nx", "omit", "p0", "performing", "plan", "raw", "reduced", "regarding", "sorry", "sources", "t0", "termination", "timeout", "transformation", "weighted", "whose", "wonder", "worse", "xx", "assert_", "b1", "butter", "consistency", "consistently", "converged", "hermitian", "inc", "incomplete", "kwarg", "moreover", "native", "odeint", "pairs", "partial", "plugins", "printed", "progress", "projects", "ratio", "repeated", "rv_discrete", "saw", "skew", "smallest", "squared", "truncnorm", "typically", "unclear", "appreciate", "assert_array_equal", "assumes", "bins", "couldn", "dataframe", "denominator", "estimated", "euclidean", "f0", "four", "hessian", "huge", "installing", "iterate", "listed", "machines", "nodes", "normalize", "prescott", "prs", "ret", "satisfied", "supporting", "suppose", "tutorial", "achieved", "additionally", "author", "bounded", "care", "cf", "coming", "community", "components", "curve", "date", "deselected", "differs", "eventually", "execute", "f1", "finfo", "finished", "fitpack", "fprime", "grad", "happened", "impact", "indicates", "initialization", "interpolated", "intervals", "iter", "libc", "logpdf", "msc", "newer", "normally", "observations", "phi", "questions", "sandybridge", "shlib", "showing", "static", "successful", "test_basic", "tf", "thrown", "took", "track", "truth", "violations", "xdist", "xlabel", "aborted", "beginning", "catch", "component", "detailed", "distributed", "duplicate", "extended", "filtering", "griddata", "hold", "ini", "interesting", "interpolator", "keepdims", "likelihood", "linearndinterpolator", "lstsq", "m1", "memoryerror", "modification", "osx", "plotting", "posted", "rotations", "saying", "sep", "shgo", "svds", "wants", "wavfile", "willing", "wouldn", "affects", "allowing", "ambiguous", "anymore", "applies", "applying", "assumed", "chosen", "confidence", "convention", "decision", "developers", "eigen", "f2", "ideas", "ignores", "infeasible", "knownfail", "leave", "llvm", "metrics", "node", "optimizeresult", "plots", "runtests", "sig", "subset", "svn", "tools", "transforms", "void", "xs", "affected", "bottom", "chi", "conjugate", "cons", "corrected", "cupy", "definitely", "delaunay", "differ", "differential_evolution", "directed", "double_scalars", "entering", "factorization", "formats", "furthermore", "group", "guide", "hz", "ks_2samp", "limitation", "mathematical", "mb", "modes", "modifying", "ns", "quadratic", "radius", "reporting", "splines", "spmatrix", "sub", "sufficient", "team", "verify", "wasn", "ylabel", "al", "analog", "approximately", "backtrace", "bash", "benefit", "blocks", "bunch", "collected", "compilation", "constrained", "convolution", "copying", "critical", "cut", "delta", "eigvals", "ever", "exceeds", "expensive", "flat", "frame", "matching", "mistake", "natural", "numeric", "perfectly", "polynomials", "reads", "regulargridinterpolator", "representing", "scientific", "select", "sigsegv", "stuff", "surprised", "tolerances", "trouble", "validation", "verified", "voronoi", "y2", "16", "achieve", "algebra", "approximate", "bspline", "complex64", "conditioned", "contents", "cval", "dendrogram", "effort", "experience", "fairly", "formulas", "gaussian_kde", "gtol", "he", "imagine", "loading", "practice", "propagate", "randomly", "refers", "rounding", "scope", "set_title", "setuptools", "smoothing", "soon", "spearmanr", "trigger", "val", "wall", "wav", "x3", "xb", "_ppf", "allocated", "anywhere", "backward", "beyond", "bigger", "boundaries", "c1", "cephes", "codes", "considering", "dear", "dec", "desirable", "detect", "err", "et", "evaluates", "expecting", "finds", "footprint", "highly", "imported", "interp2d", "interpreted", "mead", "meant", "minpack", "octave", "operand", "param", "parametrize", "pearsonr", "pickle", "positional", "quickly", "rate", "rely", "spsolve", "switching", "symmetry", "tail", "tau", "tiny", "today", "typical", "univariate", "whatever", "x64", "_argcheck", "aslinearoperator", "atlas", "computational", "configfile", "contribute", "creation", "early", "events", "gain", "gen", "google", "idx", "ii", "imshow", "interpreter", "keys", "la", "lwork", "malloc", "nelder", "netcdf", "njev", "nonlinear", "observation", "peaks", "practical", "prior", "probabilities", "procedure", "ps", "r2", "redundant", "released", "represents", "reverse", "store", "tck", "treated", "triangular", "typing", "xk", "zeros_like", "zoom", "a2", "ability", "aligned", "allocate", "analytical", "assertion", "atlas_blas_threads_info", "atlas_info", "atlas_threads_info", "boost", "bt", "coded", "contained", "contiguous", "convenient", "corner", "displayed", "downstream", "exceeded", "expose", "extrapolate", "factors", "frac", "freedom", "frozen", "goodargs", "hull", "impossible", "interpolating", "investigating", "jupyter", "linearconstraint", "log1p", "mass", "missed", "mle", "moving", "namely", "ordered", "ordering", "pcg64", "poles", "rbf", "relies", "rfc", "scaled", "scatter", "specifies", "spent", "stability", "statsmodels", "subclass", "transfer", "triggers", "00", "_pdf", "apr", "attach", "cd", "central", "complexity", "convexhull", "correspond", "corresponds", "cp313", "darwin20", "depth", "designed", "discrepancy", "dok_matrix", "draw", "drop", "finish", "freqz", "fsolve", "gmres", "hyp2f1", "ind", "jax", "kendalltau", "legacy", "linregress", "measured", "naive", "offer", "opposite", "overwrite_b", "plus", "precise", "prefer", "preferred", "presumably", "quadrature", "replacement", "rewrite", "satisfy", "shared", "signals", "stream", "superlu", "symbols", "terminate", "tocsc", "torch", "towards", "turns", "words", "01", "100", "32", "__getitem__", "behind", "cblas", "cl", "closer", "conditional", "confusion", "croot", "days", "diagonals", "eg", "endpoint", "expert", "framework", "greatly", "hangs", "hit", "ineq", "involves", "links", "literature", "lsoda", "measurements", "mtrand", "n2", "nearly", "newaxis", "normalization", "notimplementederror", "operands", "poor", "prevent", "pyeval_evalcode", "requests", "saved", "spin", "stated", "submodule", "sup", "suppress_warnings", "t1", "unlike", "v0", "workers", "acceptable", "addressed", "advantage", "arithmetic", "article", "assumption", "attempts", "bits", "brent", "brentq", "certainly", "com", "confirmed", "confused", "construction", "converges", "correction", "csv", "derived", "discuss", "event", "everyone", "fedora", "float16", "fx", "ideal", "ier", "knowledge", "loadtxt", "mannwhitneyu", "mathematica", "minimizer", "multiplying", "n1", "ndarrays", "nu", "operators", "optimizers", "peridot", "permutation", "plane", "platforms", "powell", "prevents", "rd", "requirements", "resample", "residuals", "spherical", "statements", "stdlib", "symbol", "tracked", "undocumented", "unused", "whenever", "wilcoxon", "adapted", "arises", "band", "bandwidth", "besides", "black", "bracket", "c2", "claims", "cmake", "constants", "contrast", "convex", "cumulative", "de", "efficiency", "foo", "freq", "guidance", "im", "intent", "introduce", "krylov", "kurtosis", "log10", "lti", "mkl_rt", "ml", "nonetype", "op", "opening", "overflows", "priority", "pylab", "q1", "reduction", "remaining", "represent", "revised", "roughly", "safely", "security", "settings", "six", "spectral", "spectrum", "stuck", "theory", "translation", "travis", "ttest_ind", "tuples", "unrelated", "upgrade", "vertices", "visible", "vq", "20", "__mul__", "approaches", "approx", "armv8", "atlas_3_10_blas_threads_info", "atlas_3_10_threads_info", "atlas_blas_info", "batch", "bounds_error", "circle", "con", "consequence", "constructing", "correlate", "cs", "developed", "digital", "dir", "download", "dy", "efficiently", "elsewhere", "equals", "executing", "fftconvolve", "fold", "followed", "fourier", "hypergeom", "hypergeometric", "ij", "ill", "increases", "internals", "invert", "moved", "mwe", "neighbors", "nperseg", "npy", "p1", "pearson", "pick", "regions", "remains", "represented", "requirement", "rules", "s1", "scipy_mkl_h", "skylakex", "slack", "snip", "sparsity", "stat", "struct", "subsequent", "succeeds", "syntax", "tensor", "transformed", "upgrading", "usual", "welch", "wrapping", "9", "_continuous_distns", "_rvs", "_superlu", "annoying", "apologies", "area", "arm", "avx512_knl", "blue", "choosing", "cols", "constructed", "counts", "d1", "db", "dealing", "decided", "del", "den", "describes", "det", "dual", "equal_nan", "extending", "factorial", "fitted", "goal", "hann", "hat", "head", "initialize", "interfaces", "isfinite", "kstest", "kw", "linewidth", "meaningful", "memoryview", "minutes", "mm", "mr", "multiplied", "n_samples", "nameerror", "no_atlas_info", "png", "putting", "pytorch", "removal", "repos", "resolve", "restricted", "stdout", "subclasses", "t_eval", "terminal", "unchanged", "understood", "violation", "world", "_stats", "asked", "assert_almost_equal", "asymptotic", "atlas_3_10_blas_info", "atlas_3_10_info", "atleast_1d", "attention", "chunk", "cls", "collection", "contextlib", "cp39", "decreasing", "devel", "diags", "discards", "estimates", "expects", "fits", "helps", "histogram", "imo", "implicitly", "instructions", "integrality", "integrator", "interpnd", "involve", "jan", "keyerror", "ksone", "lapack_info", "laplacian", "learning", "legendre", "loads", "locations", "lognorm", "mapping", "measure", "meth", "mind", "nnls", "oct", "overwritten", "paired", "partially", "perfect", "piece", "pop", "qmc", "quadpack", "quantile", "recommend", "refer", "repeatedly", "replicate", "reproducer", "rosen", "scales", "scratch", "seemingly", "simulation", "slope", "smooth", "sos", "splev", "splu", "subroutine", "surface", "thinking", "triangulation", "true_divide", "url", "variation", "year", "12", "__class__", "_main", "_sparsetools", "applicable", "b2", "begin", "blas_info", "build_artifacts", "co", "convenience", "criterion", "degenerate", "docker", "export", "exposed", "fc", "feedstock_root", "filtered", "filtfilt", "freqs", "globals", "gpu", "guaranteed", "guessing", "helper", "hopefully", "identified", "ifort", "initially", "insert", "int8", "introduction", "involved", "involving", "kde", "lil", "limitations", "linux2", "lld", "m2", "member", "mentions", "metadata", "morphology", "npz", "occasionally", "offers", "pixel", "population", "pos", "positions", "psd", "rb", "reasonably", "receive", "recommended", "relation", "resize", "resolution", "signed", "simpler", "situations", "slicing", "sorting", "storage", "subtract", "tags", "threading", "ties", "truncation", "units", "unknown_options", "unpack", "ys", "__cinit__", "__setitem__", "_flapack", "_hookexec", "_private", "_pyeval_evalframedefault", "_ufuncs", "answers", "architecture", "argv", "bisect", "chance", "clip", "clusters", "commonly", "completed", "converts", "correctness", "cython_blas", "cython_lapack", "ddof", "dead_strip_dylibs", "demonstrate", "discontinuity", "documents", "driver", "enhanced", "file_name", "fir", "firwin", "flexible", "forks", "geometric", "guarantee", "guesses", "headerpad_max_install_names", "hessp", "initialized", "integrals", "intermediate", "introduces", "intuitive", "kolmogorov", "leaves", "logical", "lots", "matmul", "mdict", "mixed", "mod", "netcdf_file", "netlib", "networkx", "nonlinearconstraint", "official", "offsets", "online", "opposed", "override", "paths", "percentile", "play", "prob", "producing", "programs", "ranges", "remain", "revision", "saving", "signatures", "simplify", "slices", "specfun", "speedup", "strides", "sympy", "trf", "u1", "volume", "vonmises", "wish", "yy", "50", "____________________________", "_multicall", "automatic", "avoided", "badly", "basinhopping", "bdf", "boxcox", "channels", "chi2", "chisquare", "coding", "combine", "commented", "concern", "copies", "crashed", "cwt", "d2", "declaration", "deep", "dirichlet", "display", "effectively", "engineering", "falls", "flame_info", "floor", "fn", "g1", "gpl", "hamming", "holds", "homebrew", "ignoring", "importlib", "intentional", "interactive", "isinf", "kept", "ks", "lib64", "love", "lowest", "lp", "ls", "matmat", "merge", "meta", "minimizer_kwargs", "misunderstanding", "nb", "openblas_clapack_info", "pinv", "pixels", "pointed", "pp", "preserve", "processes", "protection", "pyeval_evalcodeex", "pyeval_evalframeex", "r_", "realized", "rectbivariatespline", "respective", "root_scalar", "sampled", "screenshot", "serious", "splrep", "spurious", "stopping", "strongly", "sufficiently", "t_span", "tables", "test_stats", "themselves", "threaded", "transposed", "v1", "wait", "xa", "xrange", "zi", "13", "_000", "__doc__", "_generatorcontextmanager", "_h_env_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold", "_logpdf", "active", "allocation", "analytic", "apart", "arch", "asking", "avx512_knm", "bootstrap", "byte", "caught", "codebase", "comb", "contribution", "corruption", "coverage", "cutoff", "day", "declared", "definitions", "deterministic", "dfitpack", "dual_annealing", "dynamic", "eigenvector", "evolution", "flip", "from_euler", "gave", "harder", "hint", "hours", "imho", "infs", "inline", "integrating", "ints", "journal", "kx", "loaded", "matters", "maxfev", "meaningless", "mechanism", "milp", "numba", "optimisation", "overall", "padding", "pow", "proceed", "prod", "pypi", "remember", "representations", "resolved", "rotate", "sensible", "squeeze", "stderr", "stopped", "subject", "supply", "throwing", "transformations", "triangle", "updates", "upstream", "variant", "varying", "wave", "wide", "x4", "02", "14", "____________________", "__________________________", "__getattr__", "_distn_infrastructure", "_fitpack", "_matvec", "_nd_image", "_sf", "alone", "anderson", "argue", "asanyarray", "assign", "benchmarking", "book", "call_and_report", "candidate", "canonical", "clone", "combined", "crashing", "criteria", "dat", "disabled", "energy", "equally", "eval", "external", "fewer", "find_peaks", "fmin", "from_call", "from_quat", "g2", "graphs", "heap", "his", "history", "hyp1f1", "illustrates", "indicating", "infrastructure", "inspect", "investigate", "investigation", "ky", "leaks", "lies", "linesearch", "lw", "maxfun", "mgrid", "mirror", "mtx", "naming", "ncx2", "nevertheless", "norms", "notation", "observe", "omitted", "opened", "ord", "ordinary", "overlap", "periodic", "personally", "profile", "pyf", "pytest_cmdline_main", "pytest_runtestloop", "record", "releases", "repro", "runtestprotocol", "s2", "score", "sdl", "signaltools", "simplified", "sm", "sobol", "sparsetools", "spl", "straight", "strategy", "sym", "tends", "todo", "trans", "unboundlocalerror", "unnecessarily", "utf", "werror", "worker", "wrap_session", "wraps", "xdata", "xxx", "________________________", "_____________________________", "__array_function__", "_boost", "_csparsetools", "_h_env", "aa", "accelerate_info", "ad", "apparent", "appeared", "arg1", "asarray_chkfinite", "aug", "beneficial", "beta0", "ca", "channel", "circumstances", "clash", "clearer", "coerced", "connected", "conventions", "convolve2d", "coo_array", "cython_special", "dense_output", "distinct", "elementwise", "executable", "expand", "filled", "floc", "fmin_slsqp", "former", "friendly", "ftype", "garbage", "genextreme", "get_variables", "get_window", "gil", "groups", "harmonic", "hierarchical", "hood", "ic", "ie", "intercept", "invgauss", "iprint", "jacobians", "jv", "kendall", "kernels", "kmeans", "kron", "l1", "lapack_driver", "levy_stable", "logspace", "maintain", "mmacosx", "nct", "neighbor", "niter", "optimum", "outer", "packaged", "pasted", "presence", "presolve", "published", "py_main", "pyobject_call", "pytest_pyfunc_call", "pytest_runtest_call", "pytest_runtest_protocol", "recursive", "rename", "scipy_xslow", "send", "sentence", "seq", "sequences", "sized", "skimage", "smirnov", "spacing", "sphere", "stft", "structures", "suitable", "sy", "tails", "temporarily", "throughout", "triggered", "unicode", "unsigned", "vectorization", "website", "went", "widely", "wp", "xslow", "25", "___________________", "__file__", "_decomp_update", "_fblas", "_shortest_path", "_zeros", "adjust", "adjusted", "affine_transform", "alias", "angles", "bilinear", "c0", "carefully", "cmap", "collections", "complexwarning", "concerns", "coords", "cuda", "cycle", "decide", "dims", "discussions", "dump", "easiest", "everywhere", "executed", "experienced", "experiments", "extent", "figured", "fisher", "forcing", "frequently", "gammaln", "gauss", "get_lapack_funcs", "green", "guys", "gw2", "hasattr", "hist", "hostedtoolcache", "increased", "int16", "interpret", "isolve", "jul", "jun", "logistic", "logsumexp", "macbook", "machinery", "macosx_x86_64", "mainly", "maintained", "maintenance", "marker", "mathematically", "md", "mesh", "middle", "minimizing", "mmread", "mu2", "multiprocessing", "nested", "nightly", "o1", "openmp", "optimizations", "optionally", "pairwise", "pareto", "pcov", "physical", "physics", "pool", "products", "py2", "pyshell", "quality", "repository", "rosenbrock", "scenario", "sensitive", "sent", "set_printoptions", "shortest", "slowdown", "spdiags", "sps", "sqrtm", "suggesting", "swap", "switched", "systemerror", "theoretical", "timing", "tk", "tnc", "traced", "ts", "umfpack", "unbounded", "uniformly", "valuable", "vec", "web", "wformat", "writeable", "xe", "yi", "zpk", "zy5ktkns50v6gt5g8r0sf6sc0000gn", "_______________________", "_________________________", "_spline", "accurately", "action", "advice", "amplitude", "approx_derivative", "arise", "ascii", "automated", "avoids", "banded", "bring", "btw", "btype", "call_runtest_hook", "ccache", "cdef", "cleanup", "comparisons", "cxx", "dask", "dblquad", "decrease", "device", "dimensionality", "duplicated", "duplicates", "ed", "effects", "encounter", "errstate", "estimator", "expansion", "expectation", "explained", "expon", "expressed", "favor", "folks", "forced", "fork", "functools", "iir", "implies", "inconsistencies", "isf", "keep_feasible", "keeps", "keywords", "kmeans2", "knot", "kruskal", "laptop", "liblapack", "listcomp", "lock", "lowpass", "matfile_dict", "modifications", "modifies", "mp", "ndi", "noisy", "offending", "optimizewarning", "p2", "packaging", "pad", "padded", "parsing", "pdb", "periodogram", "pil", "pk", "pole", "principle", "projection", "quantiles", "rbfinterpolator", "realize", "relying", "removes", "restriction", "reversed", "run_mod", "schur", "science", "se", "selection", "set_initial_value", "slight", "slowly", "spearman", "spectrogram", "standard_normal", "stay", "storing", "sx", "template", "tracking", "translate", "trivially", "unexpectedly", "validate", "violates", "visual", "wavelet", "widths", "wn", "wolfram", "ydata", "_____________________", "__libc_start_main", "_bootstrap", "_core", "_minimize_lbfgsb", "_tools", "_traversal", "activate", "add_subplot", "amax", "anyio", "appendmat", "argc", "array_api_compat", "backends", "betainc", "bit_generator", "bool_", "buggy", "capture", "cauchy", "characters", "chebyshev", "clarification", "collect", "consequently", "corrupted", "cumsum", "curious", "datatype", "decode", "deriv", "dia_matrix", "digging", "dijkstra", "disappear", "disk", "dispatch", "dummy", "erf", "f8", "fall", "feels", "ffile", "find_peaks_cwt", "flow", "fraction", "full_matrices", "hdr", "identify", "iirfilter", "impulse", "indicated", "infty", "integrated", "interpolative", "ip", "isclose", "julia", "jump", "lacks", "levels", "libblas", "loggamma", "logs", "managed", "max_step", "median_filter", "mf", "minimize_scalar", "mises", "mpf", "msvc", "nicely", "noverlap", "ny", "o3", "okay", "opts", "overflowerror", "pack", "parameterization", "playing", "popt", "popular", "printing", "pro", "processed", "profiling", "quaternion", "reaches", "readline", "reduces", "reducing", "rejected", "remez", "rewritten", "rho", "rk45", "rv_generic", "s0", "scenarios", "seaborn", "seek", "semi", "server", "set_xlabel", "set_ylabel", "shifted", "shortest_path", "simulate", "sine", "skipper_func", "specification", "splprep", "survival", "temporary", "terminating", "tolist", "treat", "treats", "tri", "turned", "uint64", "underflow", "unlikely", "v2", "vary", "von", "vv", "weeks", "zerodivisionerror", "11", "30", "__", "__all__", "_eigen", "_stats_py", "_umath_linalg", "ab", "abi", "accepting", "accordingly", "areas", "argsort", "aside", "bandpass", "broke", "builtins", "c_", "ceil", "centered", "centos", "closely", "coeffs", "consideration", "container", "counter", "cover", "csd", "cumbersome", "describing", "developer", "digits", "dr", "dropped", "elapsed", "elegant", "enabling", "exited", "experiment", "expm1", "extrapolation", "ff", "fisher_exact", "fmin_bfgs", "futurewarning", "gray", "grows", "hack", "hilbert", "hoping", "improving", "instability", "interestingly", "interpn", "introducing", "invoking", "iscipy", "iterable", "itertools", "iv", "jobs", "johnson", "kinds", "l2", "lagrange", "lam", "lapack_armpl_info", "leaf", "levy", "logarithm", "lsqr", "make_interp_spline", "ncv", "nest", "net", "ones_like", "operating", "outcome", "overview", "overwrite", "pages", "pchipinterpolator", "plain", "ported", "ppoly", "prepare", "processor", "pygments", "pytb", "rayleigh", "reader", "ready", "recognize", "refactoring", "reject", "relaxed", "requiring", "rescale", "return_eigenvectors", "rmatvec", "scores", "searching", "seg", "set_integrator", "sh", "simplest", "skipping", "smp", "sound", "spaced", "spec", "squareform", "stringsource", "suddenly", "t2", "tasks", "terminates", "test_arpack", "test_decomp", "threadpoolctl", "throwflag", "timings", "tocoo", "topic", "u2", "ufuncs", "uint32", "unitary", "unsure", "variable_names", "variates", "violated", "virtual", "vode", "vortex", "ward", "wiki", "wrongly", "xnew", "09", "15", "17", "_________________", "__________________", "___________________________", "_arpack", "_bounded_integers", "_ccallback_c", "_cs_matrix", "_cythonized_array_utils", "_generator", "_min_spanning_tree", "_rotation", "_solve_toeplitz", "_start", "abort", "amd", "analytically", "argmax", "as_matrix", "attempted", "attrs", "axs", "b0", "blas_armpl_info", "bnds", "brief", "brought", "brute", "bump", "capable", "cat", "centroid", "certifi", "choices", "circular", "colab", "cond0", "costs", "dateutil", "decimate", "demand", "desktop", "developing", "distutils", "dok", "downloaded", "drawn", "ds", "empirical", "empty_like", "epsabs", "exceed", "explaining", "extra_argv", "fair", "fashion", "fcf", "feed", "formulation", "front", "functional", "gap", "ghz", "gist", "gone", "hasn", "heavy", "i1", "i386", "imports", "inconsistently", "incorporated", "independently", "informative", "integrand", "inversion", "iwork", "joblib", "json", "kappa", "led", "lhs", "libgfortran", "libopenblas", "lie", "line_search", "logcdf", "logm", "looping", "magic", "maintainers", "manner", "mar", "masked_array", "medfilt", "memoryview_cwrapper", "mine", "mio", "mmwrite", "mx", "narrow", "ncols", "network", "nquad", "nyquist", "openssl", "org", "parse", "penalty", "personal", "pocketfft", "pooch", "powers", "prefilter", "presented", "purely", "pyrun_simplefileexflags", "radians", "read_csv", "readable", "reciprocal", "recursion", "repr", "retrieve", "reviewing", "rfft", "rid", "runtime_library_dirs", "sa", "screen", "showed", "significance", "simplices", "sio", "sparray", "specialized", "studio", "test_distributions", "thinks", "tight", "tight_layout", "totally", "toy", "truly", "trunk", "ty", "typed", "uint16", "variants", "varies", "versus", "vertex", "vh", "vt", "warns", "whitney", "x10", "x5", "x_i", "xyz", "yv", "08", "1000", "200", "______________________", "_bspl", "_common", "_matrix_reader", "_munp", "_ni_support", "_quadpack", "absence", "accessing", "affine", "agrees", "align", "ans", "ap", "apologize", "appropriately", "ar", "arbitrarily", "argmin", "as_quat", "ascending", "atleast_2d", "attr", "audio", "ba", "benefits", "bias", "binned_statistic_2d", "bmat", "bsd", "butterworth", "certificates", "character", "click", "closure", "collecting", "compares", "compute_uv", "conclusion", "consumption", "contains_nan", "counting", "csc_array", "cubicspline", "culprit", "cycler", "dfun", "diagram", "directions", "domains", "eigvalsh", "emits", "encountering", "ensures", "epsrel", "errno", "estimating", "ev", "expanded", "ext", "fftw", "figure_1", "five", "fmin_l_bfgs_b", "fmt", "formatting", "fresh", "fundamental", "gmean", "goto", "headers", "hear", "heavily", "i686", "idx_dtype", "if_32", "indexed", "indexes", "instantiated", "interpolant", "invgamma", "jaccard", "jakevdp", "knows", "life", "limiting", "linearly", "lsmr", "maintaining", "markdown", "measurement", "messagestream", "minres", "miss", "motivation", "mt19937", "multinomial", "mw", "myproblem", "naively", "needing", "nonlin_solve", "notimplemented", "odrpack", "operate", "papers", "picture", "pillow", "pivot", "pkg", "plans", "prompt", "prototype", "psi", "psutil", "pxd", "pycharm", "rare", "reach", "rectangular", "refguide", "relax", "reliable", "reliably", "renamed", "res1", "resampling", "reveals", "rosen_der", "rs", "safety", "sanity", "saves", "savgol_filter", "scheme", "shaped", "si", "sides", "simulations", "skewnorm", "solve_triangular", "sounds", "sph_harm", "sphinx", "ss2tf", "stage", "stating", "suppress", "switches", "techniques", "toward", "trick", "tx", "unuran_wrapper", "valgrind", "w2", "wcwidth", "weibull_min", "wvar", "xarray", "xmax", "z2", "zlib", "zvode", "06", "07", "60", "________________", "_comb", "_customlinearoperator", "_dsolve", "_ellip_harm_2", "_h_env_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_placehold_p", "_matching", "_multiarray_umath", "_pcg64", "_ppoly", "_pyobject_maketpcall", "_specfun", "_ufuncs_cxx", "_unuran", "accessible", "actions", "adjacency", "adjoint", "aka", "akima1dinterpolator", "anybody", "anyways", "apis", "app", "appearing", "architectures", "argsreduce", "assert_raises", "assumptions", "attaching", "azure", "batched", "binary_dilation", "bisplrep", "bottleneck", "cached", "call_function", "category", "cimport", "cloughtocher2dinterpolator", "concurrent", "constrain", "consuming", "controlled", "correlations", "cryptic", "decreases", "demonstrated", "der", "descriptions", "determinant", "determines", "difficulty", "divergence", "documenting", "doubt", "drops", "duplication", "edition", "efforts", "enables", "encoding", "erroneous", "erroneously", "excellent", "experimental", "expm_multiply", "f_oneway", "fa", "factorial2", "fancy", "fastest", "feb", "fid", "flang", "forever", "foundation", "fourth", "gammainc", "genpareto", "gesdd", "golden", "gsl", "gw5", "hide", "hints", "illustrate", "impression", "in2", "inplace", "inspired", "integrationwarning", "interpolatedunivariatespline", "intersection", "irrelevant", "istate", "iterating", "ivp", "kb", "licensed", "lr", "ltl35zwt", "lu_factor", "macro", "majority", "measures", "minkowski", "mio5_utils", "mkl_info", "nargs", "nbinom", "nfft", "nn", "obs", "optimizing", "oriented", "overwrite_x", "parent", "performant", "perm", "permutations", "person", "pickleshare", "piecewise", "pivoting", "plotted", "pm", "pointing", "poly1d", "ppc", "pprint", "predict", "prone", "protocol", "put_variables", "pyd", "pyobject", "pyparsing", "pythonpath", "quit", "radau", "rankdata", "rcond", "rdiff", "realdata", "refactor", "replaces", "reproduction", "resources", "responses", "rf", "roundoff", "rv_frozen", "savefig", "scoreatpercentile", "seemed", "sequential", "shifts", "silent", "simpson", "sphericalvoronoi", "splitting", "stands", "startswith", "stores", "student", "stumbled", "submitting", "subtraction", "sums", "surprise", "ten", "test_mpmath", "test_signaltools", "texttestresult", "tm", "tp", "tracker", "traitlets", "transferfunction", "truncate", "typ", "un", "unconstrained", "uninitialized", "upgraded", "variances", "versa", "vice", "visualization", "w1", "xfail", "xlim", "xmin", "zscore", "zsh", "03", "99", "_args", "_matfuncs_sqrtm_triu", "_matmat", "_minimize_trustregion_constr", "_minpack", "_mt19937", "_not_", "_philox", "_pocketfft", "_propack", "_qhull", "_reordering", "_sfc64", "_vectorize_call", "abstract", "accessed", "adaptive", "allow_singular", "alongside", "analyzing", "approximations", "apt", "arff", "array_from_header", "array_namespace", "ascent", "assume_a", "behaved", "bernoulli", "binned_statistic_dd", "blame", "block_diag", "bsr", "cachedir", "caller", "capability", "captured", "careful", "cited", "cjgohlke", "coef", "colors", "connection", "conversions", "cp", "datetime", "dc", "dct", "dd", "descending", "detrend", "deviations", "differentiate", "difficulties", "discarded", "distfn", "distname", "divided", "doi", "dsolve", "dst", "endpoints", "environments", "erfc", "everybody", "execfile", "extracted", "face", "finishes", "finite_diff_rel_step", "flattened", "forces", "forms", "freeze", "from_matrix", "fscale", "gaussian_filter", "generators", "gib", "goodness", "gs", "gw3", "gw4", "hang", "historical", "horizontal", "iii", "importantly", "improves", "imresize", "inclusive", "indexmixin", "inference", "iniconfig", "initializing", "inspecting", "instruction", "interpolators", "interpretation", "interrupted", 